nxp-mcuxpresso/mcux-soc-svd/LPC822/LPC822.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>INPUTMUX</name>
      <description>LPC82x Input multiplexing (INPUT MUX)</description>
      <groupName>INPUTMUX</groupName>
      <baseAddress>0x40028000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4030</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>18</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DMA_ITRIG_INMUX[%s]</name>
          <description>Trigger select register for DMA channel</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>Input mux register for trigger inputs 0 to 23 connected to DMA channel 0. Selects from ADC, SCT, ACMP, pin interrupts, and DMA requests.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_SEQA_IRQ</name>
                  <description>ADC_SEQA_IRQ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SEQB_IRQ</name>
                  <description>ADC_SEQB_IRQ</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_DMA0</name>
                  <description>SCT_DMA0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_DMA1</name>
                  <description>SCT_DMA1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_O</name>
                  <description>ACMP_O</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PININT0</name>
                  <description>PININT0</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PININT1</name>
                  <description>PININT1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_INMUX_INMUX0</name>
                  <description>DMA trigger mux 0</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_INMUX_INMUX1</name>
                  <description>DMA trigger mux 1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>None</name>
                  <description>None</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DMA_INMUX_INMUX[%s]</name>
          <description>DMA output trigger selection to become DMA trigger 7 and DMA trigger 8</description>
          <addressOffset>0x4000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>DMA trigger output number (decimal value) for DMA channel n (n = 0 to 17).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SCT0_INMUX[%s]</name>
          <description>input select register for SCT</description>
          <addressOffset>0x4020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>INP_N</name>
              <description>Input mux register for SCT input n (n = 0 to 3). 0 = sct input 0 1=sct input 1 2= sct input 2 3= sct input 3 4= adc_thcmp_irq 5 = comparator out 6=arm_txev 7=debug_halted</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCT_PIN0</name>
                  <description>SCT_PIN0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_PIN1</name>
                  <description>SCT_PIN1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_PIN2</name>
                  <description>SCT_PIN2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_PIN3</name>
                  <description>SCT_PIN3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_THCMP_IRQ</name>
                  <description>ADC_THCMP_IRQ</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_O</name>
                  <description>ACMP_O</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM_TXEV</name>
                  <description>ARM_TXEV</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG_HALTED</name>
                  <description>DEBUG_HALTED</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>None</name>
                  <description>None</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>None</name>
                  <description>None</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
